/*
 Localizable.strings
 PanicLibSSH2
 
 Created by heather on 11/13/15.
 Copyright © 2015 Panic. All rights reserved.
 */

"SSH initialization failed." = "SSH初期化に失敗しました。";
"SSH connection was cancelled." = "SSH接続はキャンセルされました。";
"Couldn't connect to server." = "サーバに接続できませんでした。";
"Session startup failed." = "セッションの開始に失敗しました。";
"Password authentication not allowed." = "パスワード認証は許可されていません。";
"Username or password was not accepted by the server." = "ユーザ名かパスワードがサーバに許可されませんでした。";
"Key file was not accepted by the server." = "認証鍵がサーバに許可されませんでした。";
"Key file passphrase or authentication code was not accepted by the server." = "認証鍵のパスフレーズか認証コードがサーバに許可されませんでした。";
"Session request failed." = "セッションリクエストに失敗しました。";
"PTY request failed." = "PTYリクエストに失敗しました。";
"Shell request failed." = "シェルリクエストに失敗しました。";
"Read failed." = "読み込みに失敗しました。";
"Write failed." = "書き込みに失敗しました。";
"Read data unavailable." = "読み込みデータは利用できません。";
"Connection closed." = "接続が閉じました。";
"Verification code was not accepted by the server." = "確認コードがサーバに許可されませんでした。";
"Connection failed." = "接続に失敗しました。";
"Key file was not accepted by the server." = "認証鍵がサーバに許可されませんでした。";
"Unable to extract public key from private key file." = "秘密鍵から公開鍵を生成できませんでした。";
"Credentials were not accepted by the server." = "認証に使用している情報の一部がサーバに許可されませんでした。";
"The %@ %@ fingerprint is:\n%@" = "%@ %@ フィンガープリント:\n%@";
"RSA" = "RSA";
"DSA" = "DSA";
"ECDSA" = "ECDSA";
"ED25519" = "ED25519";
"MD5" = "MD5";
"SHA256" = "SHA256";
"Unknown" = "Unknown";

// SFTP Connection errors

"An unexpected end of file error occurred." = "予期しないファイル終了エラーが発生しました。";
"Command failed." = "失敗しました。.";
"Bad message." = "不正なメッセージです。";
"Read error." = "読み込みエラーです。";
"Write error." = "書き込みエラーです。";
"Remote stat failed." = "ファイルを見つけることができませんでした。ファイル名が変更されたり移動されたりしていないことを確認してください。";
"Local stat failed." = "ファイルを見つけることができませんでした。ファイル名が変更されたり移動されたりしていないことを確認してください。";
"Couldn't set local permissions." = "ローカルのアクセス権を設定できませんでした。";
"Couldn't set local file time." = "ローカルファイルの時間をセットできませんでした。";
"Can't download a directory." = "ディレクトリをダウンロードできませんでした。";
"Couldn't get remote handle." = "リモートハンドルを取得できませんでした。";
"Couldn't create local file." = "ローカルファイルを作成できませんでした。";
"Data packet too big." = "データパケットが大きすぎます。";
"Attributes missing permissions." = "不明なアクセス権属性です。";
"Protocol error." = "プロトコルエラーです。";
"Unable to extract public key from private key file. Make sure your passcode was entered correctly." = "秘密鍵から公開鍵を抽出できませんでした。入力のパスコードが正しいかをご確認ください。";
"Could not establish a secure connection." = "安全な接続を確立できませんでした。";
"File not found." = "File not found.";
"Make sure you have permission to modify this file." = "Make sure you have permission to modify this file.";
"Not connected." = "Not connected.";
"Server closed connection." = "Server closed connection.";
"Operation not supported." = "Operation not supported.";
"Connection refused." = "Connection refused.";
"Stat failed." = "Stat failed.";
"An SSH config file contains one or more errors. Please correct them to use this file." = "An SSH config file contains one or more errors. Please correct them to use this file.";
"Credentials were not accepted by the server." = "Credentials were not accepted by the server.";

